In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [3]:
df.head()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       5 non-null      int64
 1   Y       5 non-null      int64
 2   Z       5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

In [5]:
df.describe()

          X          Y          Z
count   5.0   5.000000   5.000000
mean   85.0  87.200000  86.800000
std     7.0   4.438468  10.281051
min    78.0  83.000000  72.000000
25%    80.0  84.000000  83.000000
50%    85.0  86.000000  86.000000
75%    86.0  89.000000  96.000000
max    96.0  94.000000  97.000000

In [6]:
df[['X', 'Y']]

    X   Y
0  78  84
1  85  94
2  96  89
3  80  83
4  86  86

In [10]:
df.iloc[:,0]

0    78
1    85
2    96
3    80
4    86
Name: X, dtype: int64

In [14]:
df.iloc[1:2, 2]

1    97
Name: Z, dtype: int64

In [15]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [16]:
df.columns = ['A', 'B', 'C']
df

    A   B   C
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [17]:
df.B.count()

5

In [18]:
df.B.mean()

87.2

In [19]:
df.B.std()

4.43846820423443

In [20]:
df.B.max()

94

In [21]:
df.B.min()

83

In [22]:
df.B.median()

86.0

In [23]:
df.B.sort_values(ascending=False)

1    94
2    89
4    86
0    84
3    83
Name: B, dtype: int64

In [25]:
df.sort_values(by='A',ascending=False)

    A   B   C
2  96  89  96
4  86  86  83
1  85  94  97
3  80  83  72
0  78  84  86

In [30]:
df[df.C >=83]

    A   B   C
0  78  84  86
1  85  94  97
2  96  89  96
4  86  86  83

In [31]:
df[(df.C >=83)& (df.B > 86)]

    A   B   C
1  85  94  97
2  96  89  96

In [33]:
df.B=df.B.replace(86, 80)

In [34]:
df

    A   B   C
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  80  83